## without inplace example

In [4]:
# importing pandas
import pandas as pd

In [5]:
# dictionary data
dict_data = {
    'A': [1, 2, 3, 4],
    'B': [5, 6, 7, 8],
    'C': [9, 10, 11, 12]
}

# preparing dataframe with dictionary data
df = pd.DataFrame(dict_data)
# show dataframe
df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [9]:
# droping column
df_drop = df.drop('A', axis=1)
# new dataframe
df_drop

   B   C
0  5   9
1  6  10
2  7  11
3  8  12

In [10]:
# orginal dataframe
df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

## with inplace example

In [14]:
# dictionary data
dict_data = {
    'A': [1, 2, 3, 4],
    'B': [5, 6, 7, 8],
    'C': [9, 10, 11, 12]
}

# preparing dataframe with dictionary data
df = pd.DataFrame(dict_data)
# show dataframe
df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [12]:
# droping column
df_drop = df.drop('A', axis=1, inplace=True)
# new dataframe
df_drop

In [13]:
# orginal dataframe
df

   B   C
0  5   9
1  6  10
2  7  11
3  8  12